1. Write a Pandas program to get the powers of an array values element-wise. Go to the editor
Note: First array elements raised to powers from second array

In [1]:
import pandas as pd
import numpy as np

In [2]:
power= {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [6]:
array=pd.DataFrame(data=power)
array

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [7]:
array.pow(2, axis=0)

      X     Y     Z
0  6084  7056  7396
1  7225  8836  9409
2  9216  7921  9216
3  6400  6889  5184
4  7396  7396  6889

In [8]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data , index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

2. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [12]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print("Summary of the basic information about this DataFrame and its data:")
print(df.info())

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [13]:
print(df.head(3))

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

3. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [16]:
print(df[["name", "score"]])

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

4. #Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [23]:
df.iloc[[1, 3, 5, 6 ], [0,1]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

5. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2

In [37]:
print(df[df['attempts'] > 2])

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

6. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [43]:
# it is giving the count of total rows into the dataframe
df.count(axis=0, numeric_only=False)

name        10
score        8
attempts    10
qualify     10
dtype: int64

In [52]:
# to get the number of rows and columns of a DataFrame.
rows=len(df.axes[0])
columns=len(df.axes[1])
print("Number of rows:", rows)
print("Number of Columns:", columns)

Number of rows: 10
Number of Columns: 4

7. Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [58]:
df[df["score"].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

8. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive)

In [69]:
df[df["score"].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

9. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [75]:
df[(df["attempts"]<2) &  (df["score"]> 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

10. Write a Pandas program to change the score in row 'd' to 11.5

In [76]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [83]:
df.loc['d', "score"]=11.5
print(df)

        name  score  attempts qualify  11.5
a  Anastasia   12.5         1     yes  11.5
b       Dima    9.0         3      no  11.5
c  Katherine   16.5         2     yes  11.5
d      James   11.5         3      no  11.5
e      Emily    9.0         2      no  11.5
f    Michael   20.0         3     yes  11.5
g    Matthew   14.5         1     yes  11.5
h      Laura    NaN         1      no  11.5
i      Kevin    8.0         2      no  11.5
j      Jonas   19.0         1     yes  11.5

11. Write a Pandas program to calculate the sum of the examination attempts by the students

In [92]:
df["attempts"].sum()

19

12. Write a Pandas program to calculate the mean score for each different student in DataFrame

In [100]:
print(df["score"].mean())

13.333333333333334

13. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [126]:
df.drop

        name  score  attempts qualify  k  g  11.5
a  Anastasia   12.5         1     yes  1  1  11.5
b       Dima    9.0         3      no  1  1  11.5
c  Katherine   16.5         2     yes  1  1  11.5
d      James   11.5         3      no  1  1  11.5
e      Emily    9.0         2      no  1  1  11.5
f    Michael   20.0         3     yes  1  1  11.5
g    Matthew   14.5         1     yes  1  1  11.5
h      Laura    NaN         1      no  1  1  11.5
i      Kevin    8.0         2      no  1  1  11.5
j      Jonas   19.0         1     yes  1  1  11.5

In [131]:
ab= df.drop(columns=['k', 'g', 11.5])

In [133]:

ab.loc['k']= ["Swe", 0, 10, "yes"]
print(ab)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k        Swe    0.0        10     yes

In [136]:
ab=ab.drop('k')

In [137]:
ab

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

14. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [146]:
ab=ab.sort_values(by=["name", "score"], ascending=[False, True])

15. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [189]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df2 = pd.DataFrame(exam_data , index=labels)
print("Summary of the basic information about this DataFrame and its data:")
print(df2.info())
df2["qualify"]=df2["qualify"].map({"yes":True, "no": False})
df2

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

16. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the

In [198]:
df2["name"]=df2["name"].replace( 'James','Suresh' )
df2.head(10)

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

17. Write a Pandas program to delete the 'attempts' column from the DataFrame

In [201]:
df2.drop(columns="attempts")

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     Suresh    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

18. Write a Pandas program to insert a new column in existing DataFrame

In [203]:
df2.insert(loc=3, column="ab", value=1)

In [204]:
df2.head()

        name  score  attempts  ab  qualify
a  Anastasia   12.5         1   1     True
b       Dima    9.0         3   1    False
c  Katherine   16.5         2   1     True
d     Suresh    NaN         3   1    False
e      Emily    9.0         2   1    False

19. Write a Pandas program to iterate over rows in a DataFrame

In [217]:
for index, row in df2.iterrows():
    print(row['name'], row["score"])

Anastasia 12.5
Dima 9.0
Katherine 16.5
Suresh nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

20. Write a Pandas program to get list from DataFrame column headers

In [220]:
list(df2)

['name', 'score', 'attempts', 'ab', 'qualify']

In [222]:
list(ab)

['name', 'score', 'attempts', 'qualify']

21. Write a Pandas program to rename columns of a given DataFrame

In [229]:
ab.rename(columns={'name': 'c1', "score":'c2', "attempts":'c3', "qualify":"c4"})

          c1    c2  c3   c4
f    Michael  20.0   3  NaN
g    Matthew  14.5   1  NaN
h      Laura   NaN   1  NaN
i      Kevin   8.0   2  NaN
c  Katherine  16.5   2  NaN
j      Jonas  19.0   1  NaN
d      James  11.5   3  NaN
e      Emily   9.0   2  NaN
b       Dima   9.0   3  NaN
a  Anastasia  12.5   1  NaN

22. Write a Pandas program to select rows from a given DataFrame based on values in some column

In [247]:
df2.loc[df2['name']=='a']

     name score attempts ab qualify
a       a  12.5        1  1    True
b       a     9        3  1   False
c       a  16.5        2  1    True
d       a   NaN        3  1   False
e       a     9        2  1   False
f       a    20        3  1    True
g       a  14.5        1  1    True
h       a   NaN        1  1   False
i       a     8        2  1   False
j       a    19        1  1    True
name    a     a        a  a       a

23. Write a Pandas program to change the order of a DataFrame columns

In [254]:
df2[['score', 'name', 'attempts', 'qualify','ab']]

     score name attempts qualify ab
a     12.5    a        1    True  1
b        9    a        3   False  1
c     16.5    a        2    True  1
d      NaN    a        3   False  1
e        9    a        2   False  1
f       20    a        3    True  1
g     14.5    a        1    True  1
h      NaN    a        1   False  1
i        8    a        2   False  1
j       19    a        1    True  1
name     a    a        a       a  a

24. Write a Pandas program to add one row in an existing DataFrame.

In [265]:
df2.loc['l']=(['a1', 2.5, 10, 2, 'True'])
df2

     name score attempts ab qualify
a       a  12.5        1  1    True
b       a     9        3  1   False
c       a  16.5        2  1    True
d       a   NaN        3  1   False
e       a     9        2  1   False
f       a    20        3  1    True
g       a  14.5        1  1    True
h       a   NaN        1  1   False
i       a     8        2  1   False
j       a    19        1  1    True
name    a     a        a  a       a
l      a1   2.5       10  2    True

25. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

In [274]:
method=[["San Diego","CA", 1],  ["New Jersy", "NY", 3], ["Texas", "TX", 10], ["Texas", "TX", 20],["Irvine", "CA", 50] ]
m=pd.DataFrame(data=method, columns=["City", "State", "ID"])

In [275]:
m

        City State  ID
0  San Diego    CA   1
1  New Jersy    NY   3
2      Texas    TX  10
3      Texas    TX  20
4     Irvine    CA  50

In [287]:
m.groupby(by="City").size()

City
Irvine       1
New Jersy    1
San Diego    1
Texas        2
dtype: int64

26. Write a Pandas program to delete DataFrame row(s) based on given column value

In [290]:
m.pop("City")

0    San Diego
1    New Jersy
2        Texas
3        Texas
4       Irvine
Name: City, dtype: object

In [291]:
m

  State  ID
0    CA   1
1    NY   3
2    TX  10
3    TX  20
4    CA  50

27. Write a Pandas program to widen output display to see more columns.

In [303]:
import pandas as pd
pd.set_option('display.max_rows', 3)
pd.set_option('display.max_columns', 3)
pd.set_option('display.width', 1000)
m

   State  ID
0     CA   1
..   ...  ..
4     CA  50

[5 rows x 2 columns]

In [294]:
df2

     name score attempts ab qualify
a       a  12.5        1  1    True
b       a     9        3  1   False
c       a  16.5        2  1    True
d       a   NaN        3  1   False
e       a     9        2  1   False
f       a    20        3  1    True
g       a  14.5        1  1    True
h       a   NaN        1  1   False
i       a     8        2  1   False
j       a    19        1  1    True
name    a     a        a  a       a
l      a1   2.5       10  2    True

28. Write a Pandas program to select a row of series/dataframe by given integer index.

In [312]:
df2.iloc[[1,2]]

  name  ... qualify
b    a  ...   False
c    a  ...    True

[2 rows x 5 columns]

In [331]:
d={"ID": [3,5,6,8,0], "Gender" :["Fe", "M", "Fe", "M", "Fe"]}

In [335]:
da=pd.DataFrame(data=d, index=[0,1,2,3,4])
da.head()

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

[0 rows x 5 columns]